CSI API ETABS v1
cAnalysisResults.ModalLoadParticipationRatios Method
 Reports the modal load participation ratios for each selected modal analysis case
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int ModalLoadParticipationRatios(
	ref int NumberResults,
	ref string[] LoadCase,
	ref string[] ItemType,
	ref string[] Item,
	ref double[] Stat,
	ref double[] Dyn
)
Function ModalLoadParticipationRatios (
	ByRef NumberResults As Integer,
	ByRef LoadCase As String(),
	ByRef ItemType As String(),
	ByRef Item As String(),
	ByRef Stat As Double(),
	ByRef Dyn As Double()
) As Integer
Dim instance As cAnalysisResults
Dim NumberResults As Integer
Dim LoadCase As String()
Dim ItemType As String()
Dim Item As String()
Dim Stat As Double()
Dim Dyn As Double()
Dim returnValue As Integer
returnValue = instance.ModalLoadParticipationRatios(NumberResults,
	LoadCase, ItemType, Item, Stat, Dyn)
int ModalLoadParticipationRatios(
	int% NumberResults,
	array<String^>^% LoadCase,
	array<String^>^% ItemType,
	array<String^>^% Item,
	array<double>^% Stat,
	array<double>^% Dyn
)
abstract ModalLoadParticipationRatios :
        NumberResults : int byref *
        LoadCase : string[] byref *
        ItemType : string[] byref *
        Item : string[] byref *
        Stat : float[] byref *
        Dyn : float[] byref -> int
Parameters
NumberResults
Type: System.Int32
 The total number of results returned by the program
LoadCase
Type: System.String[]
 This is an array that includes the name of the modal load case associated with each result
ItemType
Type: System.String[]
 This is an array that includes Load Pattern, Acceleration, Link or Panel Zone. It specifies the type of item for which the modal load participation is reported
Item
Type: System.String[]
 This is an array whose values depend on the ItemType. If the ItemType is Load Pattern, this is the name of the load pattern.
 If the ItemType is Acceleration, this is UX, UY, UZ, RX, RY, or RZ, indicating the acceleration direction.
 If the ItemType is Link, this is the name of the link followed by U1, U2, U3, R1, R2, or R3 (in parenthesis), indicating the link degree of freedom for which the output is reported.
 If the ItemType is Panel Zone, this is the name of the joint to which the panel zone is assigned, followed by U1, U2, U3, R1, R2, or R3 (in parenthesis), indicating the degree of freedom for which the output is reported.
Stat
Type: System.Double[]
 This is an array that includes the percent static load participation ratio
Dyn
Type: System.Double[]
 This is an array that includes the percent dynamic load participation ratio
Return Value
Type: Int32
 Returns zero if the data is successfully recovered; otherwise it returns a nonzero value
Remarks
 See Results for more information.
Examples
Public Sub Example()
   'dimension variables
   Dim SapObject as cOAPI
   Dim SapModel As cSapModel
   Dim ret As Integer = -1
   Dim NumberResults As Integer
   Dim LoadCase() As String
   Dim ItemType() As String
   Dim Item() As String
   Dim Stat() As Double
   Dim Dyn() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis()
   'deselect all cases and combos
       ret = SapModel.Results.Setup.DeselectAllCasesAndCombosForOutput()
   'set case selected for output
       ret = SapModel.Results.Setup.SetCaseSelectedForOutput("MODAL")
   'get modal load participation ratios
       ret = SapModel.Results.ModalLoadParticipationRatios(NumberResults, LoadCase, ItemType, Item, Stat, Dyn)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalysisResults Interface
ETABSv1 Namespace